#2. Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]
a = input().split(', ')
i1 = 0
i2 = len(a) - 1
some_list =[]
while i1 < i2:
    n = int(a[i1]) * int(a[i2])
    some_list.append(n)
    i1 += 1
    i2 -= 1
if i1 == i2:
    n = int(a[i1]) * int(a[i2])
    some_list.append(n)
print(some_list)